/* automatically generated by rust-bindgen 0.72.1 */

pub const _GLIBCXX_CSTDDEF: u32 = 1;
pub const _GLIBCXX_CXX_CONFIG_H: u32 = 1;
pub const _GLIBCXX_RELEASE: u32 = 13;
pub const __GLIBCXX__: u32 = 20240904;
pub const _GLIBCXX_HAVE_ATTRIBUTE_VISIBILITY: u32 = 1;
pub const _GLIBCXX_USE_DEPRECATED: u32 = 1;
pub const _GLIBCXX_EXTERN_TEMPLATE: u32 = 1;
pub const _GLIBCXX_USE_DUAL_ABI: u32 = 1;
pub const _GLIBCXX_USE_CXX11_ABI: u32 = 1;
pub const _GLIBCXX_INLINE_VERSION: u32 = 0;
pub const _GLIBCXX_HAVE_IS_CONSTANT_EVALUATED: u32 = 1;
pub const _GLIBCXX_VERBOSE_ASSERT: u32 = 1;
pub const _GLIBCXX_USE_ALLOCATOR_NEW: u32 = 1;
pub const _GLIBCXX_OS_DEFINES: u32 = 1;
pub const __NO_CTYPE: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _ISOC95_SOURCE: u32 = 1;
pub const _ISOC99_SOURCE: u32 = 1;
pub const _ISOC11_SOURCE: u32 = 1;
pub const _ISOC2X_SOURCE: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const _XOPEN_SOURCE: u32 = 700;
pub const _XOPEN_SOURCE_EXTENDED: u32 = 1;
pub const _LARGEFILE64_SOURCE: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const _DYNAMIC_STACK_SIZE_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_ISOCXX11: u32 = 1;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;

pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const INT8_WIDTH: u32 = 8;
pub const UINT8_WIDTH: u32 = 8;
pub const INT16_WIDTH: u32 = 16;
pub const UINT16_WIDTH: u32 = 16;
pub const INT32_WIDTH: u32 = 32;
pub const UINT32_WIDTH: u32 = 32;
pub const INT64_WIDTH: u32 = 64;
pub const UINT64_WIDTH: u32 = 64;
pub const INT_LEAST8_WIDTH: u32 = 8;
pub const UINT_LEAST8_WIDTH: u32 = 8;
pub const INT_LEAST16_WIDTH: u32 = 16;
pub const UINT_LEAST16_WIDTH: u32 = 16;
pub const INT_LEAST32_WIDTH: u32 = 32;
pub const UINT_LEAST32_WIDTH: u32 = 32;
pub const INT_LEAST64_WIDTH: u32 = 64;
pub const UINT_LEAST64_WIDTH: u32 = 64;
pub const INT_FAST8_WIDTH: u32 = 8;
pub const UINT_FAST8_WIDTH: u32 = 8;
pub const INT_FAST16_WIDTH: u32 = 64;
pub const UINT_FAST16_WIDTH: u32 = 64;
pub const INT_FAST32_WIDTH: u32 = 64;
pub const UINT_FAST32_WIDTH: u32 = 64;
pub const INT_FAST64_WIDTH: u32 = 64;
pub const UINT_FAST64_WIDTH: u32 = 64;
pub const INTPTR_WIDTH: u32 = 64;
pub const UINTPTR_WIDTH: u32 = 64;
pub const INTMAX_WIDTH: u32 = 64;
pub const UINTMAX_WIDTH: u32 = 64;
pub const PTRDIFF_WIDTH: u32 = 64;
pub const SIG_ATOMIC_WIDTH: u32 = 32;
pub const SIZE_WIDTH: u32 = 64;
pub const WCHAR_WIDTH: u32 = 32;
pub const WINT_WIDTH: u32 = 32;
pub type std_nullptr_t = *const ::std::os::raw::c_void;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type size_tp = u64;
pub type window_tp = u64;
pub type rate_tp = u64;
pub type time_tp = i32;
pub type count_tp = i32;
pub const ecn_tp_ecn_not_ect: ecn_tp = 0;
pub const ecn_tp_ecn_l4s_id: ecn_tp = 1;
pub const ecn_tp_ecn_ect0: ecn_tp = 2;
pub const ecn_tp_ecn_ce: ecn_tp = 3;
pub type ecn_tp = u8;
pub type fps_tp = u8;
pub type prob_tp = i64;
pub const cs_tp_cs_init: cs_tp = 0;
pub const cs_tp_cs_cong_avoid: cs_tp = 1;
pub const cs_tp_cs_in_loss: cs_tp = 2;
pub const cs_tp_cs_in_cwr: cs_tp = 3;
pub type cs_tp = ::std::os::raw::c_uint;
pub const cca_tp_cca_prague_win: cca_tp = 0;
pub const cca_tp_cca_prague_rate: cca_tp = 1;
pub type cca_tp = ::std::os::raw::c_uint;
pub const PRAGUE_INITWIN: count_tp = 10;
pub const PRAGUE_MINMTU: size_tp = 150;
pub const PRAGUE_INITMTU: size_tp = 1400;
pub const PRAGUE_INITRATE: rate_tp = 12500;
pub const PRAGUE_MINRATE: rate_tp = 12500;
pub const PRAGUE_MAXRATE: rate_tp = 12500000000;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PragueState {
    pub m_start_ref: time_tp,
    pub m_init_rate: rate_tp,
    pub m_init_window: window_tp,
    pub m_min_rate: rate_tp,
    pub m_max_rate: rate_tp,
    pub m_max_packet_size: size_tp,
    pub m_frame_interval: time_tp,
    pub m_frame_budget: time_tp,
    pub m_ts_remote: time_tp,
    pub m_rtt: time_tp,
    pub m_srtt: time_tp,
    pub m_vrtt: time_tp,
    pub m_r_prev_ts: time_tp,
    pub m_r_packets_received: count_tp,
    pub m_r_packets_CE: count_tp,
    pub m_r_packets_lost: count_tp,
    pub m_r_error_L4S: bool,
    pub m_cc_ts: time_tp,
    pub m_packets_received: count_tp,
    pub m_packets_CE: count_tp,
    pub m_packets_lost: count_tp,
    pub m_packets_sent: count_tp,
    pub m_error_L4S: bool,
    pub m_alpha_ts: time_tp,
    pub m_alpha_packets_received: count_tp,
    pub m_alpha_packets_CE: count_tp,
    pub m_alpha_packets_lost: count_tp,
    pub m_alpha_packets_sent: count_tp,
    pub m_loss_ts: time_tp,
    pub m_loss_cca: cca_tp,
    pub m_lost_window: window_tp,
    pub m_lost_rate: rate_tp,
    pub m_lost_rtts_to_growth: count_tp,
    pub m_loss_packets_lost: count_tp,
    pub m_loss_packets_sent: count_tp,
    pub m_cwr_ts: time_tp,
    pub m_cwr_packets_sent: count_tp,
    pub m_cc_state: cs_tp,
    pub m_cca_mode: cca_tp,
    pub m_rtts_to_growth: count_tp,
    pub m_alpha: prob_tp,
    pub m_pacing_rate: rate_tp,
    pub m_fractional_window: window_tp,
    pub m_packet_burst: count_tp,
    pub m_packet_size: size_tp,
    pub m_packet_window: count_tp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PragueState"][::std::mem::size_of::<PragueState>() - 240usize];
    ["Alignment of PragueState"][::std::mem::align_of::<PragueState>() - 8usize];
    ["Offset of field: PragueState::m_start_ref"]
        [::std::mem::offset_of!(PragueState, m_start_ref) - 0usize];
    ["Offset of field: PragueState::m_init_rate"]
        [::std::mem::offset_of!(PragueState, m_init_rate) - 8usize];
    ["Offset of field: PragueState::m_init_window"]
        [::std::mem::offset_of!(PragueState, m_init_window) - 16usize];
    ["Offset of field: PragueState::m_min_rate"]
        [::std::mem::offset_of!(PragueState, m_min_rate) - 24usize];
    ["Offset of field: PragueState::m_max_rate"]
        [::std::mem::offset_of!(PragueState, m_max_rate) - 32usize];
    ["Offset of field: PragueState::m_max_packet_size"]
        [::std::mem::offset_of!(PragueState, m_max_packet_size) - 40usize];
    ["Offset of field: PragueState::m_frame_interval"]
        [::std::mem::offset_of!(PragueState, m_frame_interval) - 48usize];
    ["Offset of field: PragueState::m_frame_budget"]
        [::std::mem::offset_of!(PragueState, m_frame_budget) - 52usize];
    ["Offset of field: PragueState::m_ts_remote"]
        [::std::mem::offset_of!(PragueState, m_ts_remote) - 56usize];
    ["Offset of field: PragueState::m_rtt"][::std::mem::offset_of!(PragueState, m_rtt) - 60usize];
    ["Offset of field: PragueState::m_srtt"][::std::mem::offset_of!(PragueState, m_srtt) - 64usize];
    ["Offset of field: PragueState::m_vrtt"][::std::mem::offset_of!(PragueState, m_vrtt) - 68usize];
    ["Offset of field: PragueState::m_r_prev_ts"]
        [::std::mem::offset_of!(PragueState, m_r_prev_ts) - 72usize];
    ["Offset of field: PragueState::m_r_packets_received"]
        [::std::mem::offset_of!(PragueState, m_r_packets_received) - 76usize];
    ["Offset of field: PragueState::m_r_packets_CE"]
        [::std::mem::offset_of!(PragueState, m_r_packets_CE) - 80usize];
    ["Offset of field: PragueState::m_r_packets_lost"]
        [::std::mem::offset_of!(PragueState, m_r_packets_lost) - 84usize];
    ["Offset of field: PragueState::m_r_error_L4S"]
        [::std::mem::offset_of!(PragueState, m_r_error_L4S) - 88usize];
    ["Offset of field: PragueState::m_cc_ts"]
        [::std::mem::offset_of!(PragueState, m_cc_ts) - 92usize];
    ["Offset of field: PragueState::m_packets_received"]
        [::std::mem::offset_of!(PragueState, m_packets_received) - 96usize];
    ["Offset of field: PragueState::m_packets_CE"]
        [::std::mem::offset_of!(PragueState, m_packets_CE) - 100usize];
    ["Offset of field: PragueState::m_packets_lost"]
        [::std::mem::offset_of!(PragueState, m_packets_lost) - 104usize];
    ["Offset of field: PragueState::m_packets_sent"]
        [::std::mem::offset_of!(PragueState, m_packets_sent) - 108usize];
    ["Offset of field: PragueState::m_error_L4S"]
        [::std::mem::offset_of!(PragueState, m_error_L4S) - 112usize];
    ["Offset of field: PragueState::m_alpha_ts"]
        [::std::mem::offset_of!(PragueState, m_alpha_ts) - 116usize];
    ["Offset of field: PragueState::m_alpha_packets_received"]
        [::std::mem::offset_of!(PragueState, m_alpha_packets_received) - 120usize];
    ["Offset of field: PragueState::m_alpha_packets_CE"]
        [::std::mem::offset_of!(PragueState, m_alpha_packets_CE) - 124usize];
    ["Offset of field: PragueState::m_alpha_packets_lost"]
        [::std::mem::offset_of!(PragueState, m_alpha_packets_lost) - 128usize];
    ["Offset of field: PragueState::m_alpha_packets_sent"]
        [::std::mem::offset_of!(PragueState, m_alpha_packets_sent) - 132usize];
    ["Offset of field: PragueState::m_loss_ts"]
        [::std::mem::offset_of!(PragueState, m_loss_ts) - 136usize];
    ["Offset of field: PragueState::m_loss_cca"]
        [::std::mem::offset_of!(PragueState, m_loss_cca) - 140usize];
    ["Offset of field: PragueState::m_lost_window"]
        [::std::mem::offset_of!(PragueState, m_lost_window) - 144usize];
    ["Offset of field: PragueState::m_lost_rate"]
        [::std::mem::offset_of!(PragueState, m_lost_rate) - 152usize];
    ["Offset of field: PragueState::m_lost_rtts_to_growth"]
        [::std::mem::offset_of!(PragueState, m_lost_rtts_to_growth) - 160usize];
    ["Offset of field: PragueState::m_loss_packets_lost"]
        [::std::mem::offset_of!(PragueState, m_loss_packets_lost) - 164usize];
    ["Offset of field: PragueState::m_loss_packets_sent"]
        [::std::mem::offset_of!(PragueState, m_loss_packets_sent) - 168usize];
    ["Offset of field: PragueState::m_cwr_ts"]
        [::std::mem::offset_of!(PragueState, m_cwr_ts) - 172usize];
    ["Offset of field: PragueState::m_cwr_packets_sent"]
        [::std::mem::offset_of!(PragueState, m_cwr_packets_sent) - 176usize];
    ["Offset of field: PragueState::m_cc_state"]
        [::std::mem::offset_of!(PragueState, m_cc_state) - 180usize];
    ["Offset of field: PragueState::m_cca_mode"]
        [::std::mem::offset_of!(PragueState, m_cca_mode) - 184usize];
    ["Offset of field: PragueState::m_rtts_to_growth"]
        [::std::mem::offset_of!(PragueState, m_rtts_to_growth) - 188usize];
    ["Offset of field: PragueState::m_alpha"]
        [::std::mem::offset_of!(PragueState, m_alpha) - 192usize];
    ["Offset of field: PragueState::m_pacing_rate"]
        [::std::mem::offset_of!(PragueState, m_pacing_rate) - 200usize];
    ["Offset of field: PragueState::m_fractional_window"]
        [::std::mem::offset_of!(PragueState, m_fractional_window) - 208usize];
    ["Offset of field: PragueState::m_packet_burst"]
        [::std::mem::offset_of!(PragueState, m_packet_burst) - 216usize];
    ["Offset of field: PragueState::m_packet_size"]
        [::std::mem::offset_of!(PragueState, m_packet_size) - 224usize];
    ["Offset of field: PragueState::m_packet_window"]
        [::std::mem::offset_of!(PragueState, m_packet_window) - 232usize];
};
#[repr(C)]
pub struct PragueCC__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct PragueCC {
    pub vtable_: *const PragueCC__bindgen_vtable,
    pub _base: PragueState,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PragueCC"][::std::mem::size_of::<PragueCC>() - 248usize];
    ["Alignment of PragueCC"][::std::mem::align_of::<PragueCC>() - 8usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}_ZN8PragueCC11get_ref_rttEv"]
    pub fn PragueCC_get_ref_rtt(this: *mut PragueCC) -> time_tp;
}
unsafe extern "C" {
    #[link_name = "\u{1}_ZN8PragueCC15get_alpha_shiftEv"]
    pub fn PragueCC_get_alpha_shift(this: *mut PragueCC) -> count_tp;
}
unsafe extern "C" {
    #[link_name = "\u{1}_ZN8PragueCC15RFC8888ReceivedEmPi"]
    pub fn PragueCC_RFC8888Received(
        this: *mut PragueCC,
        num_rtt: usize,
        pkts_rtt: *mut time_tp,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}_ZN8PragueCC14PacketReceivedEii"]
    pub fn PragueCC_PacketReceived(
        this: *mut PragueCC,
        timestamp: time_tp,
        echoed_timestamp: time_tp,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}_ZN8PragueCC11ACKReceivedEiiiibRi"]
    pub fn PragueCC_ACKReceived(
        this: *mut PragueCC,
        packets_received: count_tp,
